; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-2)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	)
(:init
	(at plane1 city7)
	(= (capacity plane1) 10011)
	(= (fuel plane1) 389)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 12)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at plane2 city3)
	(= (capacity plane2) 14993)
	(= (fuel plane2) 1556)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 18)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 3)
	(at plane3 city7)
	(= (capacity plane3) 7405)
	(= (fuel plane3) 1577)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at plane4 city5)
	(= (capacity plane4) 9706)
	(= (fuel plane4) 2309)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 14)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 6)
	(at plane5 city5)
	(= (capacity plane5) 3082)
	(= (fuel plane5) 663)
	(= (slow-burn plane5) 1)
	(= (fast-burn plane5) 3)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 2)
	(at person1 city4)
	(at person2 city7)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 550)
	(= (distance city0 city2) 728)
	(= (distance city0 city3) 817)
	(= (distance city0 city4) 922)
	(= (distance city0 city5) 753)
	(= (distance city0 city6) 805)
	(= (distance city0 city7) 674)
	(= (distance city1 city0) 550)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 939)
	(= (distance city1 city3) 701)
	(= (distance city1 city4) 881)
	(= (distance city1 city5) 694)
	(= (distance city1 city6) 662)
	(= (distance city1 city7) 643)
	(= (distance city2 city0) 728)
	(= (distance city2 city1) 939)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 513)
	(= (distance city2 city4) 814)
	(= (distance city2 city5) 747)
	(= (distance city2 city6) 871)
	(= (distance city2 city7) 920)
	(= (distance city3 city0) 817)
	(= (distance city3 city1) 701)
	(= (distance city3 city2) 513)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 690)
	(= (distance city3 city5) 648)
	(= (distance city3 city6) 761)
	(= (distance city3 city7) 626)
	(= (distance city4 city0) 922)
	(= (distance city4 city1) 881)
	(= (distance city4 city2) 814)
	(= (distance city4 city3) 690)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 651)
	(= (distance city4 city6) 894)
	(= (distance city4 city7) 964)
	(= (distance city5 city0) 753)
	(= (distance city5 city1) 694)
	(= (distance city5 city2) 747)
	(= (distance city5 city3) 648)
	(= (distance city5 city4) 651)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 693)
	(= (distance city5 city7) 729)
	(= (distance city6 city0) 805)
	(= (distance city6 city1) 662)
	(= (distance city6 city2) 871)
	(= (distance city6 city3) 761)
	(= (distance city6 city4) 894)
	(= (distance city6 city5) 693)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 787)
	(= (distance city7 city0) 674)
	(= (distance city7 city1) 643)
	(= (distance city7 city2) 920)
	(= (distance city7 city3) 626)
	(= (distance city7 city4) 964)
	(= (distance city7 city5) 729)
	(= (distance city7 city6) 787)
	(= (distance city7 city7) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane4 city5)
	(at person1 city3)
	(at person2 city0)
	))

(:metric minimize (+ (* 4 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (board person2 plane3 city7)
   deleted: (at person2 city7)
   added: (in person2 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 1 of 3
2. (refuel plane3 city7)
   changed: (fuel plane3) from 1577 to 7405
   goals met: 1 of 3
3. (fly plane3 city7 city0)
   deleted: (at plane3 city7)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 0 to 2022, (fuel plane3) from 7405 to 5383
   goals met: 1 of 3
4. (debark person2 plane3 city0)
   deleted: (in person2 plane3)
   added: (at person2 city0)
   changed: (onboard plane3) from 1 to 0
   goals met: 2 of 3
5. (fly plane5 city5 city3)
   deleted: (at plane5 city5)
   added: (at plane5 city3)
   changed: (total-fuel-used) from 2022 to 2670, (fuel plane5) from 663 to 15
   goals met: 2 of 3
6. (fly plane3 city0 city4)
   deleted: (at plane3 city0)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 2670 to 5436, (fuel plane3) from 5383 to 2617
   goals met: 2 of 3
7. (board person1 plane3 city4)
   deleted: (at person1 city4)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 2 of 3
8. (fly plane3 city4 city3)
   deleted: (at plane3 city4)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 5436 to 7506, (fuel plane3) from 2617 to 547
   goals met: 2 of 3
9. (debark person1 plane3 city3)
   deleted: (in person1 plane3)
   added: (at person1 city3)
   changed: (onboard plane3) from 1 to 0
   goals met: 3 of 3
